---
kind: method
id: M:Autodesk.Revit.DB.Definitions.GetEnumerator
source: html/04eb20a9-e445-2d27-1c3e-7fbc32065120.htm
---
# Autodesk.Revit.DB.Definitions.GetEnumerator Method

Retrieves an enumerator to the collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<Definition> GetEnumerator()
```

## Returns
The enumerator.